# DataFrames

In [47]:
import pandas as pd
import numpy as np
from numpy.random import randn

## Creamos un Dataframe

In [50]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split()) # ['A', 'B', 'C',....]

In [51]:
df

          W         X         Y         Z
A -0.628286  0.188313 -0.926442  1.552520
B -1.246357  0.110477 -1.049563  1.303950
C  0.222230 -0.227685  1.171147  0.453622
D  0.290047 -0.145189 -0.843775 -0.396962
E -0.471734 -0.513280 -0.520610 -1.983010

In [52]:
type(df)

pandas.core.frame.DataFrame

### Consultamos una columna (serie)

In [53]:
colY = df['Y']

In [9]:
colY

A    0.197966
B    1.978243
C   -1.075643
D    0.914322
E    0.993547
Name: Y, dtype: float64

In [55]:
type(colY)

pandas.core.series.Series

### Podemos consultar mas de una columna

In [11]:
df[['W','Z']]

          W         Z
A -0.392293  1.584200
B  1.326266  2.043774
C  0.565285 -1.086199
D  1.504232  1.529488
E  0.413619  1.076428

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

### Algunas funciones

In [13]:
df['Z'].mean()

1.0295380647815082

In [14]:
df['Z'].sum()

5.147690323907541

In [57]:
# funcion describe()
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean  -0.366820 -0.117473 -0.433849  0.186024
std    0.638633  0.280644  0.918331  1.434683
min   -1.246357 -0.513280 -1.049563 -1.983010
25%   -0.628286 -0.227685 -0.926442 -0.396962
50%   -0.471734 -0.145189 -0.843775  0.453622
75%    0.222230  0.110477 -0.520610  1.303950
max    0.290047  0.188313  1.171147  1.552520

### Borrar una fila / columna

In [16]:
df

          W         X         Y         Z
A -0.392293  0.885309  0.197966  1.584200
B  1.326266  1.890497  1.978243  2.043774
C  0.565285 -0.601479 -1.075643 -1.086199
D  1.504232 -0.945295  0.914322  1.529488
E  0.413619 -1.615497  0.993547  1.076428

In [58]:
df.drop('D', inplace=True) # borrar filas y asignando de nuevo al dataframe

In [20]:
df

          W         X         Y         Z
A -0.392293  0.885309  0.197966  1.584200
B  1.326266  1.890497  1.978243  2.043774
C  0.565285 -0.601479 -1.075643 -1.086199
E  0.413619 -1.615497  0.993547  1.076428

In [22]:
df.drop('Y', axis=1) # borrar columnas

          W         X         Z
A -0.392293  0.885309  1.584200
B  1.326266  1.890497  2.043774
C  0.565285 -0.601479 -1.086199
E  0.413619 -1.615497  1.076428

In [23]:
df

          W         X         Y         Z
A -0.392293  0.885309  0.197966  1.584200
B  1.326266  1.890497  1.978243  2.043774
C  0.565285 -0.601479 -1.075643 -1.086199
E  0.413619 -1.615497  0.993547  1.076428

In [24]:
df.drop('Y', axis=1, inplace=True) # borrar columnas

In [25]:
df

          W         X         Z
A -0.392293  0.885309  1.584200
B  1.326266  1.890497  2.043774
C  0.565285 -0.601479 -1.086199
E  0.413619 -1.615497  1.076428

In [26]:
# seleccionar columnas

In [27]:
df['W']

A   -0.392293
B    1.326266
C    0.565285
E    0.413619
Name: W, dtype: float64

In [28]:
# seleccionar filas

In [32]:
df.loc[['C', 'A']]

          W         X         Z
C  0.565285 -0.601479 -1.086199
A -0.392293  0.885309  1.584200

In [33]:
# seleccionar filas por indice numerico

In [37]:
df.iloc[1:3]

          W         X         Z
B  1.326266  1.890497  2.043774
C  0.565285 -0.601479 -1.086199

In [40]:
# Seleccion condicional

In [41]:
df

          W         X         Z
A -0.392293  0.885309  1.584200
B  1.326266  1.890497  2.043774
C  0.565285 -0.601479 -1.086199
E  0.413619 -1.615497  1.076428

In [39]:
df > 0.5

       W      X      Z
A  False   True   True
B   True   True   True
C   True  False  False
E  False  False   True

In [43]:
df[(df['Z'] > 0) & (df['W'] > 0)]

          W         X         Z
B  1.326266  1.890497  2.043774
E  0.413619 -1.615497  1.076428

In [46]:
df[df['Z'] > 0]['W'].sum()

1.3475927044463096